<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ตรวจคำทำนายเบอร์</title>
    <link rel="stylesheet" href="https://www.w3schools.com/w3css/4/w3.css">
    <link rel="preconnect" href="https://fonts.gstatic.com">
<link href="https://fonts.googleapis.com/css2?family=Kanit:wght@300&family=Sarabun:wght@200&display=swap" rel="stylesheet">
    <style>

            body {
                    background-color: linen;
                }

            h1, h2, h3, h4, h5, h6   {
                    font-family: "Kanit", Times, serif;
                }
            body, p {

                font-family: "Sarabun", time, serif;
                font-size: 18px;
                }

            a:link {
                text-decoration: none;
                }
            

    </style>
    
</head>
<body>
<div class="w3-container">
    

<?php
// นำเข้าไฟล์เพื่อเชื่อมต่อฐานข้อมูล

include 'connect.php'; ?>


<?php

// รับค่าตัวเลขมาจาก form ไฟล์ index.html

$mobile_number = $_POST['mobile_number'];


    if ($mobile_number >= "1") {

              //  mysqli_query($conn, "INSERT INTO number (number) VALUES ('$mobile_number')");


                    echo "<h2>เบอร์มือถือ $mobile_number</h2>"; 
                    echo "<h2>เกรด :</h2>"; 




                            $str = $mobile_number;
                            $arr1 = str_split($str);

                            $num1 = $arr1[3].$arr1[4];
                            $num2 = $arr1[4].$arr1[5];
                            $num3 = $arr1[5].$arr1[6];
                            $num4 = $arr1[6].$arr1[7];
                            $num5 = $arr1[7].$arr1[8];
                            $num6 = $arr1[8].$arr1[9];
                            $num7 = $arr1[0]+$arr1[1]+$arr1[2]+$arr1[3]+$arr1[4]+$arr1[5]+$arr1[6]+$arr1[7]+$arr1[8]+$arr1[9];

                            echo "<p style='color:red;'>* ทำนายเบอร์มือถือโดยแยกเป็นเลขคู่ 6 ชุดและทำนายผลรวม เพื่อความแม่นยำโปรดปรึกษาท่านผู้รู้ศาสตร์แห่งตัวเลขควบคู่ไปด้วย</p>";
                            echo "<h4>เบอร์ ".$str." มีเลขคู่ 6 ชุดดังนี้</h4>";

                            /* ทำนายเลขเป็นคู่ๆ แยกออกเป็น 6 คู่ตัวเลข */
                            echo "<div class='w3-panel w3-light-grey w3-border w3-round'><p>";

                            echo $arr1[0].$arr1[1].$arr1[2]."<b style='color:red;'> ".$arr1[3].$arr1[4]." </b>".$arr1[5].$arr1[6].$arr1[7].$arr1[8].$arr1[9]." เลขคู่ชุดที่ 1 คือ <b>".$num1."</b><br>"; 
                            echo $arr1[0].$arr1[1].$arr1[2].$arr1[3]."<b style='color:red;'> ".$arr1[4].$arr1[5]." </b>".$arr1[6].$arr1[7].$arr1[8].$arr1[9]." เลขคู่ชุดที่ 2 คือ <b>".$num2."</b><br>";
                            echo $arr1[0].$arr1[1].$arr1[2].$arr1[3].$arr1[4]."<b style='color:red;'> ".$arr1[5].$arr1[6]." </b>".$arr1[7].$arr1[8].$arr1[9]." เลขคู่ชุดที่ 3 คือ <b>".$num3."</b><br>";
                            echo $arr1[0].$arr1[1].$arr1[2].$arr1[3].$arr1[4].$arr1[5]."<b style='color:red;'> ".$arr1[6].$arr1[7]." </b>".$arr1[8].$arr1[9]." เลขคู่ชุดที่ 4 คือ <b>".$num4."</b><br>";
                            echo $arr1[0].$arr1[1].$arr1[2].$arr1[3].$arr1[4].$arr1[5].$arr1[6]."<b style='color:red;'> ".$arr1[7].$arr1[8]." </b>".$arr1[9]." เลขคู่ชุดที่ 5 คือ <b>".$num5."</b><br>";
                            echo $arr1[0].$arr1[1].$arr1[2].$arr1[3].$arr1[4].$arr1[5].$arr1[6].$arr1[7]."<b style='color:red;'> ".$arr1[8].$arr1[9]." "." </b> "." เลขคู่ชุดที่ 6 คือ <b> ".$num6."</b><br>";
                            echo "</p></div>";
 


                        // เข้าถึงฐานข้อมูลตัวเลขและดึงมาตรวจสอบกับชุดเลขคู่ชุดที่ 1     
                        $sql = "SELECT * FROM `num-meaning` WHERE number='$num1'";
                        $result = $conn->query($sql);



                        if ($result->num_rows > 0) {
                        while($row = $result->fetch_assoc()) {
                        echo "<br><b>ความหมายเลขคู่ที่ 1 คือ: ". $row["number"]. "</b><p>" . $row["meaning"] . "</p><br>";
                            }
                        } else {
                        echo "0 results";
                            }

                        
                        // เข้าถึงฐานข้อมูลตัวเลขและดึงมาตรวจสอบกับชุดเลขคู่ชุดที่ 2    
                        $sql = "SELECT * FROM `num-meaning` WHERE number='$num2'";
                        $result = $conn->query($sql);


                        if ($result->num_rows > 0) {
                        while($row = $result->fetch_assoc()) {
                        echo "<br><b> ความหมายเลขคู่ที่ 2 คือ: ". $row["number"]. "</b><p>" . $row["meaning"] . "</p><br>";
                            }
                        } else {
                        echo "0 results";
                        }

                        // เข้าถึงฐานข้อมูลตัวเลขและดึงมาตรวจสอบกับชุดเลขคู่ชุดที่ 3
                        $sql = "SELECT * FROM `num-meaning` WHERE number='$num3'";
                        $result = $conn->query($sql);

                        if ($result->num_rows > 0) {
                        while($row = $result->fetch_assoc()) {
                        echo "<br><b> ความหมายเลขคู่ที่ 3 คือ ". $row["number"]. "</b><p> " . $row["meaning"] . "</p><br>";
                            }
                        } else {
                        echo "0 results";
                        }

                        // เข้าถึงฐานข้อมูลตัวเลขและดึงมาตรวจสอบกับชุดเลขคู่ชุดที่ 4
                        $sql = "SELECT * FROM `num-meaning` WHERE number='$num4'";
                        $result = $conn->query($sql);

                        if ($result->num_rows > 0) {
                            // output data of each row
                        while($row = $result->fetch_assoc()) {
                        echo "<br><b> ความหมายเลขคู่ที่ 4 คือ ". $row["number"]. "</b><p> " . $row["meaning"] . "<p><br>";
                            }
                        } else {
                        echo "0 results";
                        }

                        // เข้าถึงฐานข้อมูลตัวเลขและดึงมาตรวจสอบกับชุดเลขคู่ชุดที่ 5
                        $sql = "SELECT * FROM `num-meaning` WHERE number='$num5'";
                        $result = $conn->query($sql);

                        if ($result->num_rows > 0) {
                            // output data of each row
                        while($row = $result->fetch_assoc()) {
                        echo "<br><b> ความหมายเลขคู่ที่ 5 คือ ". $row["number"]. "</b><p> " . $row["meaning"] . "</p><br>";
                            }
                        } else {
                        echo "0 results";
                        }

                        // เข้าถึงฐานข้อมูลตัวเลขและดึงมาตรวจสอบกับชุดเลขคู่ชุดที่ 6
                        $sql = "SELECT * FROM `num-meaning` WHERE number='$num6'";
                        $result = $conn->query($sql);

                        if ($result->num_rows > 0) {
                        // output data of each row
                        while($row = $result->fetch_assoc()) {
                        echo "<br><b> ความหมายเลขคู่ที่ 6 คือ ". $row["number"]. "</b> <p>" . $row["meaning"] . "</p><br>";
                        }

                        
                        } else {
                        echo "0 results";
                        }



                        $conn->close();




                        // เข้าเงื่อนไขทำนายแบบผลรวมของเบอร์มือถือ swith case
                        echo "<b>เบอร์ ".$str." </b><br>";
                        echo "ผลรวมเลขเบอร์นี้คือ :  <b>".$num7 ."</b>";

                        echo "<br>";
                        //ตรวจสอบผลรวมของเลขว่า ตรงกับเลขใดและแสดงความหมายผลรวมเลขนั้น
                            switch ($num7) {
                            case 1:
                                echo"<p>ดาวอาทิตย์ดาวพลังความเชื่อมั่น
                                เลข 1 เป็นดาวที่ทรงพลังมีอานุภาพมาก มีปฏิภาณกล้าหาญ มีความคิดดี มีชื่อเสียงด้านผู้นำ มุมานะ ทะยาน ชอบเที่ยวไปทุกที่ ชอบผจญภัย มีคนนับถือมาก</p>";
                                break;

                            case 2:
                                echo"<p>ดาวจันทร์ดาวพลังแห่งจินตนาการ
                                เลข 2 เป็นช่างฝัน มีอารมณ์ศิลปิน มองโลกในแง่ดี แก้ไขปัญหาได้ดี เป็นคนเอื้ออาทรต่อผู้อื่น</p>";
                                break;

                            case 3:
                                echo"<p>ดาวอังคารดาวพลังแห่งความกล้าหาญชาญชัย
                                เลข 3 รักอิสระแบบไม่มีแก่นสาร ชอบใฝ่หาความรู้ ชอบเรียนสูงๆ คนพูดจาแบบขวานผ่าซาก รักความยุติธรรม ใจกว้าง ระวังเรื่องเจ็บป่วยจากระบบประสาท ทำงานหนักมากเกินไป</p>";
                                break;

                            case 4:
                                echo"<p>ดาวพุธพลังแห่งดาวสติปัญญา
                                เลข 4 เป็นคนฉลาดมีสติปัญญาไหวพริบดีมาก รู้ทันคน ฉลาดในการวางตัวในที่ทุกสถาน ชอบเดินทางไกล บางครั้งเหมือนขาดเพื่อนแท้ แต่เพราะความฉลาดของตนเองจึงประสบความสำเร็จในชีวิตได้</p>";
                                break;
                                
                            case 5:
                                echo"<p>ดาวพลังแห่งปัญญาปัญญาทางธรรมะ
                                เลข 5 มีความรู้ดี มีปัญญา เป็นคนน่าเชื่อถือและน่าเลื่อมใสศรัทธาของคนที่พบเห็น ทำการงานใดๆ มักราบรื่น มีคุณธรรม จิตใจดีมีเมตตาใฝ่ไปในทางธรรม</p>";
                                break;    

                            case 6:
                                echo"<p>ดาวแห่งศิลปะวิทยาการ
                                เลข 6 มีความสุขสบาย มีจินตนาการ ชอบศิลปะ ชอบอิสระ มีโลกส่วนตัว ไม่เบียดเบียนใคร จิตใจดีมีเมตตา ผู้คนรักใคร่ มีเสน่ห์ มีตำแหน่งหน้าที่การงานดี ร่ำรวยด้วยทรัพย์สินเงินทอง</p>";
                                break;

                            case 7:
                                echo"<p>ดาวเสาร์ดาวพลังแห่งทุกข์โศก
                                เลข 7 เป็นคนรักอิสระและมีความคิดเป็นของตนเองอย่างเด่นชัด ไม่ชอบตามแบบใคร เป็นคนรักงานศิลปะ นักเขียน นักวาด นักกวี มีความพิเศษในการแก้ไขปัญหา เป็นคนใจบุญศุลทาน
                                </p>";
                                break;

                            case 8:
                                echo"<p>ดาวราหูพลังแห่งความลุ่มหลงมัวเมา
                                เลข 8 เป็นคนพูดน้อย ขี้อาย ชอบปลีกตัวอยู่ตามลำพัง ไม่ใคร่คบค้าสมาคมกับใครง่าย ตอนเป็นเด็กสุขภาพไม่แข็งแรง ป่วยบ่อย โตขึ้นร่างกายจะแข็งแรง อายุยืน เป็นคนมีอารมณ์ขันแบบลึก ไม่ค่อยมีอารมณ์ขัน มาดขรึมๆ ชอบเอาความคิดของคนอื่นมาลบล้างความคิดของตนเอง มีระเบียบวินัย เฉลียวฉลาด แต่ภายในจิตใจแล้วจะเดียวดาย ต้องการความรัก ความอบอุ่น ไม่ต่างอะไรกับเด็ก สุขภาพ มักมีปัญหาในเรื่องตับ ถุงน้ำดี ระบบขับถ่าย มักมีอาการปวดศรีษะ โลหิตเป็นพิษ โรคเจ็บปวดตามข้อ</p>";
                                break;

                            case 9:
                                echo"<p>พลังดาวเกตุพลังแห่งความลึกลับ
                                เลข 9 คล้ายเป็นคนหยิ่งยโส แต่ลึกเป็นคนขาดความเชื่อมั่นในตนเองมากๆ เป็นคนที่มีความตั้งใจจริง มักตัดสินใจอะไรด้วยอารมณ์ชั่ววูบและต้องมานั่งเสียใจกับการตัดสินใจในภายหลัง เป็นคนปากกับใจตรงกัน อารมณ์ร้อน โกรธง่ายหายเร็ว ทำคุณคนไม่ขึ้น ปิดทองหลังพระ มักพบกับความตรงกันข้าม ความไม่จริงใจ ความหลอกลวง</p>";
                                break;

                            case 10:
                                echo"<p>พลังแห่งอุปสรรค
                                เลข 10 เป็นคนมีความมั่นใจในตัวเองสูง มีความทะเยอทะยานดี ชอบของแปลกใหม่ ไม่ชอบซ้ำแบบใคร เป็นคนถือเกียรติ ไม่ชอบอยู่ใต้บังคับบัญชาของใคร ไม่ค่อยนุ่มนวล กล้าได้กล้าเสีย ชีวิตมักมีอุปสรรค จับงานอะไรมักจะเจอคู่แข่ง มีคนปองร้าย บริวารมักให้โทษ เป็นคนอาภัพ มีศัตรูรอบด้าน ชีวิตมักจะมีเรื่องระทมขมขื่นแอบแฝงอยู่ มีโรคภัยไข้เจ็บเบียดเบียนอย่างเรื้อรัง ระวังโรคหัวใจ มีภาระหนี้สิน มีศัตรูคอยกลั่นแกล้ง ชีวิตก็มีประสบความสำเร็จอยู่บ้าง คือสำเร็จอย่างแหวกแนวไม่เหมือนใคร แต่ถ้าเวลาดวงตกก็จะสูญสิ้นในพริบตา</p>";
                                break;    

                            case 11:
                                echo"<p>พลังแห่งความขัดแย้งในตัวเอง
                                เลข 11 เป็นคนหลงตัวเองเป็นหลักชอบอวดอ้าง ทำอะไรชอบเข้าข้างตัวเอง มักถือพวกพ้องเป็นคนดื้อรั้นมาก จิตใจรวนเร เชื่อคนง่าย ระวังจะโดนทรยศหักหลังจากคนที่เราไว้ใจ</p>";
                                break;    

                            case 12:
                                echo"<p>พลังแห่ง 2 บุคลิกในคนเดียว
                                เลข 12 หยิ่ง,ลุ่มหลงมัวเมาหูเบา,เจ็บไม่จำ เป็นคนเชื่อใจคนง่ายจึงมักถูกยุยงได้ง่าย ชีวิตเกิดอุบัติเหตุได้ง่าย มีโรคภัยไข้เจ็บเบียดเบียนอย่างเรื้อรัง หากหลงใครแล้วมักจะหลงอย่างไม่ลืมหูลืมตา
                                </p>";
                                break;   
                                
                            case 13:
                                echo"<p>การเปลี่ยนแปลงทั้งดีและร้าย
                                เลข 13 ชีวิตมักเจอเรื่องทั้งเรื่องดี เรื่องร้ายอย่างฉับพลัน มีโชคอย่างไม่คาดคิดมาก่อนแต่ในขณะเดียวกันก็จะมีเหตุร้ายเกิดขึ้นอย่างไม่คาดฝันเช่นกัน ไม่ชอบให้ใครมาท้าทาย ไม่ชอบเดินตามร้อยเท้าใคร กล้าแบบไม่กลัวใคร จึงมักส่งผลให้เกิดอันตรายและล้าเหลวในบั้นปลาย เป็นคนตัดสินใจผิดพลาดทั้ง ๆ ที่รู้ ต้องระวังอุบัติเหตุทุกรูปแบบ ผ่าตัด ช่องท้อง รถคว่ำ ถูกอาวุธ ถูกคนลอบทำร้าย ครอบครัวมีปัญหาแตกร้าว ชีวิตคู่ไม่ปกติสุข ผู้ใหญ่ให้โทษ เรื่องชู้สาว และสายตามีปัญหา ผู้ใหญ่กดดัน</p>";
                                break;   
                                
                            case 14:
                                echo"<p>พลังแห่งมีสติปัญญาไหวพริบและมงคล
                                เลข 14 มีความรู้ ความสามารถดี ฉลาดมีไหวพริบ ตำแหน่งหน้าที่การงานก้าวไกล ผู้คนยอมรับ มีศีลธรรมอันดี รักความถูกต้องเที่ยงธรรม มีส่วนน้อยที่มีอุปสรรคบ้างซึ่งเป็นเรื่องธรรมดา แต่ส่วนมากดี มีความรุ่งเรื่องเจริญก้าวหน้ามาก</p>";
                                break;    

                            case 15:
                                echo"<p>พลังแห่งเสน่ห์
                                เลข 15 เป็นตัวเลขที่ดี มีเพื่อนมาก คนรักใคร่มากมาย อารมณ์ดี จิตใจดี เข้าได้กับทุกคน มีศิลปะในการพูด ทำให้คนรักใคร่เกื้อหนุน ดวงชะตามีเกียรติยศชื่อเสียง มีโชคลาภ</p>";
                                break;  

                            case 16:
                                echo"<p>พลังชีวิตที่ต้องฝ่าฟัน
                                เลข 16 มีความทุกข์ อุปสรรค ปัญหา อับโชค วิตมักจะประสบกับโชคร้ายมากกว่าความสำเร็จ แม้จะมีวาสนาสูง เกิดเป็นลูกเศรษฐี ลูกคนรวย ชีวิตก็ต้องมีอุปสรรค มีศัตรูมาก มักจะแพ้ภัยจากศัตรู หากมีความสำเร็จของชีวิตที่ยิ่งใหญ่ ต้องระวังจะพบจุดจบอย่างไม่คาดคิด ถูกคนปองร้าย ถูกอำนาจมืดคุกคาม จะตกต่ำในบั้นปลายของชีวิต เลขนี้ไม่เหมาะกับสุภาพสตรี จะทำให้ผิดหวังในเรื่องความรักทุกรูปแบบ เช่น แต่งงานช้า ไม่ได้แต่งงาน แต่งแล้วต้องเลิก ได้พ่อหม้าย เป็นสามี เป็นเมียน้อย กินน้ำใต้ศอกคนอื่น หรือเป็นหม้ายก่อนวัยอันควร</p>";
                                break;  

                            case 17:
                                echo"<p>พลังแห่งความไม่แน่นอน
                                เลข 17 มีสติปัญญาแตกฉาน เข้าใจอะไรได้ง่าย ชีวิตมักจะพบกับอุปสรรคและความยุ่งยาก ในชีวิตอยู่บ่อย ๆ มักจะถูกผู้ใหญ่กดดัน ผู้ใหญ่มักจะให้โทษ ชีวิตขึ้น ๆ ลง ๆ ไม่แน่นอน ชีวิตสมรถไม่สมหวัง เป็นคนหูเบาเชื่อคนง่าย ค่อนข้างจะดื้อรั้นเอาแต่ใจตัวเอง</p>";
                                break; 

                            case 18:
                                echo"<p>พลังชีวิตแห่งการเปลี่ยนแปลง
                                เลข 18 อยู่ไม่ติดที่ มีการโยกย้ายเปลี่ยนแปลงบ่อยๆ ไม่สมหวังในเรื่องคู่ครอง เลขนี้ไม่เหมาะสำหรับสุภาพสตรี ให้ระวังการทรยศหักหลังการถูกหลอกลวง</p>";
                                break; 

                            case 19:
                                echo"<p>พลังแห่งความสำเร็จจากผู้อุปถัมภ์
                                เลข 19 ดวงค่อนข้างดี มีความสำเร็จและดีเด่นทางด้านการศึกษาและหน้าที่การงานสูงส่ง ไม่มีวันอับจนและตกอับ หมายเลขนี้ดีต่อชายร้ายต่อหญิง คือไม่เหมาะสำหรับผู้หญิง เพราะเป็นหญิงจะถูกกลั่นแกล้ง อาภัพรัก ชีวิตรักมักผิดหวัง หากเป็นชายจะมีความรุ่งโรจน์มาก</p>";
                                break;     

                            case 20:
                                echo"<p>พลังแห่งความสำเร็จที่ต้องอาศัยผู้อื่นช่วยหนุนนำ
                                เลข 20 ไม่ชอบอยู่นิ่งอยู่กับที่ มีความทะเยอทะยาน เพ้อฝัน เลขนี้ไม่เหมาะกับสุภาพสตรี ชีวิตมักจะมีปัญหาเรื่องคู่ กดดันจนทำให้ต้องเป็นคนไร้คู่หรือไม่ก็เป็นเมียน้อย กินน้ำใต้ศอกผู้อื่น</p>";
                                break;     

                            case 21:
                                echo"<p>พลังแห่งการพลิกผัน
                                เลข 21 เป็นคนมีเสน่ห์ เอาแต่ใจตัวเอง เป็นคนเด็ดเดี่ยวกล้าตัดสินใจ โดยที่ผู้อื่นคาดคิดไม่ถึง ชีวิตไม่ค่อยสมหวัง ชีวิตหาความแน่นอนไม่ได้เลย</p>";
                                break;

                            case 22:
                                echo"<p>พลังแห่งการเพ้อฝัน
                                เลข 22 เป็นคนเพ้อฝัน อารมณ์อ่อนไหว หูเบาเชื่อใจคนง่าย ถูกหลอกอยู่เสมอ
                                </p>";
                                break;

                            case 23:
                                echo"<p>พลังเสน่ห์เมตตามหานิยม
                                เลข 23 เป็นคนมีอารมณ์แข็งกร้าวโทสะจริต ไม่ยอมแพ้คน เป็นคนเจ้าชู้ หากเป็นชายมักมีเรื่องอื้อฉาวเกี่ยวกับเรื่องความรัก เป็นหญิงดี เพราะจะมีผู้ใหญ่ที่มีอิทธิพลคอยให้การช่วยเหลือสนับสนุนส่งเสริมให้ชีวิตประสบความสำเร็จเป็นอย่างดี</p>";
                                break;

                            case 24:
                                echo"<p>พลังแห่งมหามงคลความสำเร็จ
                                เลข 24 สมบูรณ์พูนผล ชีวิตไม่ยุ่งยาก เป็นคนฉลาดมีปฏิภาณไหวพริบ ไม่ถือตัว มีเพื่อนมากมาย เป็นคนดีมีเมตตา เอื้อเฟื้อช่วยเหลือผู้อื่น หากมุ่งมั่นที่จะเป็นดารา นักร้อง ศิลปินจะประสบความสำเร็จ มีชื่อเสียงโด่งดัง แต่อย่าประมาทกับการดำรงชีวิตให้ทำบุญบ้างดีเสริมดวงชะตาได้ดีมากๆ
                                </p>";
                                break;

                            case 25:
                                echo"<p>พลังร้ายและพลังดี
                                เลข 25 ชีวิตมีอุปสรรคมาก กว่าจะประสบความสำเร็จต้องเจออุปสรรคมากมาย ถูกศัตรูปองร้าย ถูกกลั่นแกล้ง ถูกอำนาจมืดคุกคาม ถูกปล้น ถูกจี้ ชีวิตจะพบกับความผันผวนอย่างรุนแรง อาจถูกปองร้ายจนถึงแก่ชีวิต ต้องประสบกับการเปลี่ยนแปลง ทำให้ชีวิตขึ้น ๆ ลง ๆ หาความแน่นอนไม่ได้</p>";
                                break;

                            case 26:
                                echo"<p>พลังแห่งความไม่มั่นคง
                                เลข 26 มีความสำเร็จแต่ไม่ยั่งยืนถาวร ระวังเรื่องโลกีย์ไว้ให้มากๆ ระวังการผิดศีลธรรมเรื่องโลกีย์</p>";
                                break;

                            case 27:
                                echo"<p>พลังแห่งความมุ่งมั่น
                                เลข 27 ชีวิตประสบความสำเร็จอย่างงดงาม แต่ชีวิตมักจะมีความกดดันอย่างรุนแรง ทำให้เหมือนคนอมทุกข์ มีโรคภัยไข้เจ็บแทรกประจำตัว ถ้าเป็นชายมักผิดหวังเรื่องความรักบ่อยๆ ระวังมักจะมีโรคภัยไข้เจ็บอย่างเรื้อรัง</p>";
                                break;

                            case 28:
                                echo"<p>พลังแห่งความแปรปรวน
                                เลข 28 เสียมากกว่าดี เป็นคนไม่รอบคอบ เป็นคนเบื่อง่าย ไม่ไว้ใจผู้อื่น มักมีเรื่องทุกข์ใจ ไม่มีความสุขในชีวิตสมรส ต้องพลัดพรากจากกันอยู่กันคนละทิศละทาง</p>";
                                break;

                            case 29:
                                echo"<p>พลังความรุนแรง
                                เลข 29 ชีวิตมักจะหักกลาง ถูกปองร้ายจากศัตรู ระวังเรื่องอุบัติเหตุ ชีวิตอมทุกข์ ไม่ยอมคน มั่นใจในตนเอง เผด็จการ ภายนอกสดใส แต่ภายในอมทุกข์ ให้ระวังเพื่อนที่ไม่ซื่อ และเพศตรงข้าม
                                </p>";
                                break;

                            case 30:
                                echo"<p>พลังแห่งอุบัติเหตุ
                                เลข 30 ชีวิตไม่หยุดนิ่งอยู่กับที่ แต่ะทำอะไรต้องระวังมีสติให้มาก ชีวิตมีอุปสรรคบ้าง แต่ไม่มาก เป็นคนมีเพื่อนน้อย ค่อนข้างเงียบขรึม ไม่ชอบแสดงตัว ชอบใช้ชีวิตอยู่ตามลำพัง
                                </p>";
                                break;

                            case 31:
                                echo"<p>พลังแห่งความไม่แน่นอนของโชคชะตา
                                เลข 31 ชีวิตในเบื้องต้นจะลำบาก แต่จะประสบความสำเร็จในบั้นปลาย แต่ระวังชีวิตมักจะหักกลาง ความรักหักกลางคัน ชีวิตสมรสไม่แน่นอน ระวังเรื่องอุบัติเหตุรถคว่ำ ถูกอาวุธ ถูกคนลอบทำร้าย การผ่าตัด และการถูกแย่งชิงตำแหน่งหน้าที่การงาน
                                </p>";
                                break;

                            case 32:
                                echo"<p>พลังแห่งเจ้าชู้มีเสน่ห์
                                เลข 32 เป็นคนเจ้าชู้ มีเสน่ห์ มักต้นร้ายปลายดี ต้องระวัง ชีวิตมักจะมีอุบัติเหตุ มีโรคภัยไขเจ็บเบียดเบียนอย่างเรื้อรัง มีคนอุปถัมภ์</p>";
                                break;
                                
                            case 33:
                                echo"<p>พลังความฉุนเฉียวเร้าร้อน
                                เลข 33 มีอารมณ์ฉุนเฉียว เร่าร้อน รุนแรง ทำอะไรชอบเอาแต่ใจตนเอง ระวังอันตรายแบบฉับพลัน มักจะประสบอุบัติเหตุอย่างร้ายแรง มักจะมีอันตรายเกี่ยวกับความเร็ว เช่น อุบัติเหตุทางรถยนต์ การทะเลาะวิวาท
                                </p>";
                                break;
                                
                            case 34:
                                echo"<p>พลังแห่งความรอบรู้ครุ่นคิด
                                เลข 34 เป็นคนมีสติปัญญาแตกฉาน ว่องไว มีปฏิภาณดีเป็นคนกล้าหาญ กล้าพูดกล้าทำ แต่ชีวิตมีอุปสรรคมาก เหน็ดเหนื่อยมาก ลำบากอยู่กับปัญหาตลอด แต่ก็เอาตัวรอดได้ ให้ระวังเรื่องอุบัติเหตุหรือการพลัดตกหกล้ม ถึงขั้นทำให้เป็นอัมพาตได้</p>";
                                break;
                                
                            case 35:
                                echo"<p>พลังแห่งคุณและโทษ
                                เลข 35 ไม่ค่อยดีนัก ชีวิตมักอาภัพ กำพร้า ชีวิตบั้นปลายมีความสำเร็จดี มีผู้อุปถัมภ์ แต่ต้องระวังการหลงผิด มักหูเบาเชื่อใจคนง่าย จะมีคนชั่วร้ายเข้ามาสู่ชีวิต</p>";
                                break;
                                
                            case 36:
                                echo"<p>พลังแห่งความรักความอบอุ่น
                                เลข 36 เลข 36 เป็นเลขที่หมายถึงความรัก ความสดชื่นของชีวิต ชีวิตจะประสบความสำเร็จเป็นอย่างดี มีมิตรสหาย มาก สติปัญญามีหัวทางประดิษฐ์คิดค้น ถ้าเป็นเด็กจะฉลาดเรียนเก่ง เป็นคนมีเสน่ห์ดึงดูดใจเพศตรงข้าม และเพศตรงข้ามมักให้ความอบอุ่นเป็นอย่างดี โชคดีมีการงานดีตำแหน่งสูง เด่นในด้านความรัก มีเสน่ห์ คู่ครองดีมีความรู้ ดาวศุกร์กับดาวอังคารเป็นดาวคู่มิตรกัน รวมกันได้ 9 ดีมาก</p>";
                                break;

                            case 37:
                                echo"<p>พลังความวิบัติ
                                เลข 37 ไม่ดีเลย ชีวิตมีแต่เรื่องขัดแย้ง ทะเลาะวิวาท โชคร้าย ผ่าตัด อุบัติเหตุ คู่ครองมีเหตุให้เป็นไป พรัดพราก ชีวิตมีมุมหักเหตลอดเวลาขึ้น ๆ ลง ๆ ไม่ราบรื่นนัก</p>";
                                break;

                            case 38:
                                echo"<p>พลังแห่งโมหะจริต
                                เลข 38 เป็นเลขร้าย ส่งผลในทางไม่ดี หมกมุ่นอยู่กับกามคุณ ทางทางผิด ติดเหล้ายา ติดการพนัน และอบายมุขทุกอย่าง เชื่อตัวเองมากเกินไป หมกมุ่นอยู่กับไสยศาสตร์ เวทมนต์คาถา ส่งผลร้ายต่อชีวิต ผิดทำนองคลองธรรม โกรธง่าย อารมณ์ฉุนเฉียว เป็นคนเจ้าอารมณ์</p>";
                                break;

                            case 39:
                                echo"<p>พลังแห่งความกดดัน
                                เลข 39 ชีวิตพบเจอเรื่องยุ่งยากบ่อยๆ แต่ก็มีมิตรสหายให้ความเกื้อกูลช่วยเหลือเป็นอย่างดี</p>";
                                break;
                                
                            case 40:
                                echo"<p>พลังอำนาจมหัศจรรย์
                                เลข 40 ไม่เดือดร้อนอะไร เป็นคนใฝ่รู้ชอบค้นคว้าหาความรู้ ชอบสนุกสนาน สุขสบาย ชอบเดินทางไกลท่องเที่ยว ชอบสิ่งใหม่ๆ และแปลกๆ ไม่ชอบอยู่ติดที่ เป็นคนอ่อนไหวง่าย ดวงชะตาจัดว่าดี
                                </p>";
                                break;

                            case 41:
                                echo "<p>พลังมหาจักรวาล
                                เลข 41 นี้เป็นเลขที่ดีมาก เป็นพลังมหาจักรวาล มีความรุ่งโรจน์ สุขสบาย เป็นคนฉลาด ชีวิตไม่ตกต่ำ มีคนคอยช่วยเหลือมากมาย มีคนอุปถัมภ์ เพื่อนมิตรสหายมาก บ่งถึงความสำเร็จในชีวิตเป็นอย่างดี ผู้ใหญ่มักจะให้การอุปถัมภ์ ปัญญาว่องไว มีสมองปราดเปรื่อง ตั้งแต่วัยเด็กเป็นคนเข้ากับมิตรสหายได้อย่างสนิท ควรเสริมชะตาด้วยการทำบุญ</p>";
                                break;

                            case 42:
                                echo "<p>พลังโรแมนติค
                                เลข 42 เป็นเลขมงคลยิ่ง 4 ดาวพุธ รวมกับ 2 ดาวจันทร์ รวมกันได้ 6 ดาวศุกร์ เป็นคนใจเย็น มีจินตนาการกว้างไกล อารมณ์ศิลปะ ชอบกวีนิพนธ์ มีจิตใจละเอียดอ่อน โรแมนติก มีความละมุนละไม ในสายเลือด มีหัวทางประดิษฐ์คิดค้น สมองแจ่มใสมาก สู้ชีวิต เรื่องรักและการงานสำเร็จดังใจ มีเงินทองไม่ขาดมือ ชีวิตประสบความสำเร็จเป็นอย่างดี มีมิตรสหายมาก มักเป็นที่รักแก่คนทั้งมวล
                                </p>";
                                break;

                            case 43:
                                echo "<p>พลังวิปริต
                                เลข 43 มีศัตรูคอยกลั่นแกล้งอยู่เบื้องหลังตลอดเวลา มีอุปสรรค ความทุกข์ ความผิดหวังล้มเหลว</p>";
                                break;

                            case 44:
                                echo "<p>พลังส่งเสริมความสำเร็จ
                                เลข 44 เลข ๔๔ เป็นเลขที่ส่งเสริมทุกด้านทั้งหน้าที่การงาน การเรียน ความรัก ส่งเสริมความสำเร็จทุกด้าน ไม่ลำบาก มีผู้ใหญ่คอยเกื้อหนุน แต่เลข ๔๔ นี้รวมกันได้ ๘ ทำให้หลงระเริง ระวังอย่าประมาทในการดำรงชีวิต ดวงชะตาถือว่าดี มีเพียงจุดเสียเล็กน้อยเท่านั้น จุดเสียคือคุณเป็นคุณใจน้อย เอาแต่ใจตัวเอง ถ้าแก้จุดนี้ได้จะดีมาก</p>";
                                break;

                            case 45:
                                echo"<p>พลังการสู้อีกครั้ง
                                เลข 45 ดวงดีมาก ดาว 4 (พุธ) กับดาว 5 (พฤหัส) รวมกันได้ 9 (ดาวเกตุ) การงานก้าวหน้า ปัญญาดีฉลาดหลักแหลม ใจสู้ไม่ถอย ก้าวหน้าตลอดเวลา มีคนคอยช่วยเหลือ โชคดีมีลาภ เจริญรุ่งเรือง ชีวิตมักจะมีโชคอยู่เนืองๆ มักจะประสบโชคอันไม่คาดหวังอยู่บ่อยๆ สติปัญญาแจ่มใสดีมาก และจะได้รับความร่วมมือจากทุกวงการเป็นอย่างดี</p>";
                                break;

                            case 46:
                                echo"<p>พลังแห่งโชค
                                เลข 46 มีความสุข มีความสำเร็จ มีเพื่อนมาก เสียอยู่นิดตรงที่เป็นคนใจอ่อน มักตกอยู่ใต้อิทธิพลคนอื่นได้ง่าย</p>";
                                break;
                                
                            case 47:
                                echo"<p>พลังแห่งความเพียร
                                เลข 47 มักจะใจอ่อนเชื่อคนง่าย แต่ถ้าดื้อรั้นขึ้นมาก็ยากที่จะหยุดได้ ต้องระวังการหลงผิด ชีวิตกว่าจะประสบความสำเร็จต้องเหนื่อยและต้องใช้ความพยายามและอดทนสูง</p>";
                                break;

                            case 48:
                                echo"<p>พลังการหลง
                                เลข 48 ไม่ดีเลย ควรระวังอย่าเชื่อใจใครง่ายๆ จะถูกจูงหว่านล้อม หลงผิด ระวังจะประสบอุบัติเหตุ มักมีโรคภัยไข้เจ็บเบียดเบียน</p>";
                                break;

                            case 49:
                                echo"<p>พลังความยุ่งยาก
                                เลข 49 ไม่ค่อยดี มีความอับโชค ชีวิตมีอุปสรรค มักถูกอำนาจมืดคุกคาม ถ้าเป็นสุภาพสตรีจะถูกญาติสามีกดดันกลั่นแกล้ง</p>";
                                break;
                                    
                            case 50:
                                echo"<p>พลังแห่งปัญญาและความสามารถ
                                เลข 50 ดวงดีมาก โดยเฉพาะเรื่องปัญญา มีความสามารถ ดีเด่นทางทำงานต่างประเทศ มักพบคู่รักต่างแดน เป็นคนมีญาณพิเศษ มีบุญ ถ้าทำธุรกิจติดต่อกับชาวต่างชาติ เช่น ธุรกิจส่งออกเป็นต้นจะประสบความสำเร็จอย่างดี</p>";
                                break;


                            case 51:
                                echo"<p>พลังความสมบูรณ์
                                เลข 51 บวกกันได้ 6 ดาวศุกร์ ถือว่าเป็นเลขดีเลขหนึ่งเพราะเป็นดาวศุภเคราะห์ บ่งถึงความสำเร็จ มีมิตรสหายมาก มีรสนิยมในทางศิลป์ ฝีมือละเอียดอ่อนปราณีต เลข 5 ดาวพฤหัส เลข 1 ดาวอาทิตย์ ธาตุไฟทั้งคู่ จึงส่งเสริมให้มีอำนาจ สติปัญญาแตกฉาน อำนวยความสำเร็จให้กับชีวิตเป็นอย่างดี เป็นเลขที่ดีมีมงคล มีความเจริญด้านการงาน ธุรกิจ การเงิน การเรียน เรื่องความรัก สารพัด ไม่ติดขัด มีผู้ใหญ่คอยช่วยเหลือ มีพรสวรรค์ทางสร้างสรรค์ ศิลปะ ดนตรี การพูด มีเสน่ห์ เป็นเลขที่สมบูรณ์ดียิ่ง</p>";
                                break;

                            case 52:
                                echo"<p>พลังการสนับสนุนค้ำจุน
                                เลข 52 มีความสำเร็จด้านการงานและความรักดี หากเป็นชายจะมีคุณสนับสนุนจากผู้หญิง หรือเจ้านายคนใกล้ชิด จะก้าวไกลทุกด้าน แต่ต้องอดทนฟันฝ่าอุปสรรคบ้าง หากเป็นหญิงจะมีอุปสรรคเพราะกรรมเก่า
                                </p>";
                                break;

                            case 53:
                                echo"<p>พลังการหักเห
                                เลข 53 ชีวิตมีทั้งดีและร้ายปะปนกันไป ไม่มากไม่น้อย อย่าหูเบาเชื่อคนง่าย ให้ดำเนินชีวิตด้วยความไม่ประมาท ทำอะไรให้รอบคอบ จะเกิดผลดีและชีวิตจะประสบความสำเร็จ</p>";
                                break;

                            case 54:
                                echo"<p>พลังมหาราชาโชคความสำเร็จ
                                เลข 54 เป็นมงคลแก่ชีวิตยิ่งที่ได้ชื่อนี้ เพราะรวมกันได้ ๙ พอดี เรื่องงาน ความรัก และอื่นๆ สำเร็จสมปรารถนา จะมีตำแหน่งสูง คนเคารพนับถือ ปัญญาดี เรียนอะไรก็แตกฉาน มีคนคอยค้ำจุนหนุนส่ง ไม่มีทางตกต่ำหรือขาดแคลน สิ่งศักดิ์สิทธิ์คุ้มครอง</p>";
                                break;
                                
                            case 55:
                                echo"<p>พลังความสุขสมหวัง
                                เลข 55 นี้บ่งบอกถึงความสมบูรณ์พูนผล มีสุขสำเร็จดังใจหวัง การงานก็ตำแหน่งสูง ความรักดี มีแฟนฉลาดและดวงดี มีหลักฐาน ทำธุรกิจการค้าขายก็จะได้กำไรเพิ่มพูนยิ่ง คุณเป็นคนมีศีลธรรม ชอบความยุติธรรม คนรักมากมาย มีเสน่ห์ มีศีลธรรม จิตใจดีมีเมตตา ผู้คนรักใคร่ มีสติปัญญาเฉลียวฉลาด เป็นเลขที่มีความสุขสมบูรณ์มาก</p>";
                                break;    

                            case 56:
                                echo"<p>พลังศิลป์และปัญญา
                                เลข 56 ดวงชะตาอยู่ในเกณฑ์ดีมาก เพราะมีดาวศุกร์กับพฤหัสบดี มีความโดดเด่นด้านปฏิภาณไหวพริบ อารมณ์ศิลป์ ทำอะไรมีความรอบคอบดี ประสบความสำเร็จทุกด้าน เช่น การเรียน การงาน การเงิน มองโลกในแง่ดี สู้อย่างไม่ถอย นำชีวิตไปสู่จุดหมายคือความสำเร็จได้ อีกอย่างเป็นคนมีเสน่ห์ มีน้ำใจ ผู้คนรักใคร่มากมาย
                                </p>";
                                break;

                            case 57:
                                echo"<p>พลังความมั่นใจในตัวเองสูง
                                เลข 57 เป็นคนค่อนข้างจะดื้อรั้น ชีวิตไม่ค่อยแน่นอน ทำอะไรไม่ค่อยประสบความสำเร็จเพราะยกเลิกกลางครัน</p>";
                                break;

                            case 58:
                                echo"<p>พลังความลุ่มหลงงมงาย
                                เลข 58 ไม่ดีเลย หลงผิด เห็นกงจักรเป็นดอกบัว ออกนอกลู่นอกทางอยู่เสมอ</p>";
                                break;

                            case 59:
                                echo"<p>พลังแห่งขนบธรรมเนียมประเพณี
                                เลข 59 จิตใจดีมีเมตตาสูง มีศีลธรรม ดวงด้านความรักดี มีคนคอยช่วยเหลือ เจริญรุ่งเรือง</p>";
                                break;

                            case 60:
                                echo"<p>พลังความเพ้อฝันและจินตนาการ
                                เลข 60 เป็นคนรักสวยรักงาม ชอบความเป็นอยู่อย่างโอ่อ่าและเพ้อฝัน ทำอะไรมักเกินตัว ดีสำหรับหญิง แต่ไม่ดีสำหรับชาย เด็กผู้ชายทำให้จิตใจเบี่ยงเบนเป็นตุ๊ด (กระเทย) ได้งาย</p>";
                                break;    

                            case 61:
                                echo"<p>พลังบุคลิกซ้อน
                                เลข 61 ไม่ค่อยดีนัก มีความขัดแย้งในตัวเอง เป็นเลขแห่งความทุกข์ อุปสรรค และปัญหาบั้นปลายชีวิต จะตกต่ำและเหน็ดเหนื่อย</p>";
                                break;    

                            case 62:
                                echo"<p>พลังการเกื้อกูลและพลิกผัน
                                เลข 62 ไม่ดีเลย หลงผิดได้่ง่าย เพราะปล่อยตัวปล่อยใจเกินไป ดีตรงที่มีคนคอยช่วยเหลืออุปถัมภ์ เป็นชายมีเสน่ห์ต่อเพศตรงข้าม</p>";
                                break;   
                                
                            case 63:
                                echo"<p>พลังความรักไม่มีสิ้นสุด
                                เลข 63 ดีมาก ไม่มีอุปสรรคและเรื่องยุ่งยาก ก้าวหน้าด้านการงาน การเรียนดี ดีเด่นเรื่องความรัก มีเพื่อนมาก ควรทำบุญเสริมดวงจะดีมากๆ และจะโชคดีตลอด</p>";
                                break;   
                                
                            case 64:
                                echo"<p>พลังความอ่อนไหวและการเปลี่ยนแปลง
                                เลข 64 เป็นคนมีรสนิยมสูง มีเสน่ห์ แต่ระวังจะถูกผู้อื่นหลอกลวง ชีวิตพบความสำเร็จ มีความสุข ความสะดวกของชีวิตพอสมควร</p>";
                                break;    

                            case 65:
                                echo"<p>พลังความก้าวหน้าและเสน่ห์
                                เลข 65 เป็นเลขที่อยู่ในเกณฑ์ดี หากชื่อของคุณบวกรวมกับสกุลแล้วได้เลขนี้ พยากรณ์ได้เลยว่าเจ้าของชื่อเป็นคนฉลาดไหวพริบดี รักความก้าวหน้า จะได้รับความช่วยเหลือจากผู้ใหญ่หรือมีผู้คอยช่วยเหลืออยู่ตลอด กิจการและการงานราบรื่น เลขนี้จะดีเด่นเรื่องความก้าวหน้าและเรื่องของความรักมีเสน่ห์แก่เพศตรงข้ามมากเป็นพิเศษ</p>";
                                break;  

                            case 66:
                                echo"<p>พลังแห่งอารมณ์และความรู้สึก
                                เลข 66 ไม่ดีเลย มอมเมา ลุ่มหลง ไม่พิจารณาไตร่ตรอง เป็นเลขอันตราย</p>";
                                break;  

                            case 67:
                                echo"<p>พลังแห่งความผิดหวัง ทุกข์เศร้า
                                เลข 67 ชีวิตมีอุปสรรค ผิดหวัง ขัดแย้ง ครอบครัวแตกร้าว ตกต่ำในบั้นปลายของชีวิต</p>";
                                break; 

                            case 68:
                                echo"<p>พลังแห่งอบายมุข
                                เลข 68 ไม่ดีเลย ลุ่มหลง มัวเมา หลงไหล ขาดสติในการพิจารณา อาจถูกชักจูงหรือถูกหลอกได้ง่าย
                                </p>";
                                break; 

                            case 69:
                                echo"<p>พลังความอ่อนไหว
                                เลข 69 เป็นคนใจอ่อน ชอบเพ้อฝัน ทำให้ตกอยู่ใต้อิทธิพลผู้อื่นได้ง่าย แต่ยังดีที่มีผู้ใหญ่คอยให้การอุปถัมภ์ค้ำชู จึงพอทำให้ชีวิตไปรอด</p>";
                                break;     

                            case 70:
                                echo"<p>พลังแห่งเคราะห์กรรม
                                เลข 70 ไม่ดีเลย ให้ระวังความคิด อย่าหลงผิด ควรดำเนินชีวิตด้วยความรอบคอบไม่มาท เพราะเลขนี้ร้ายมาก บั้นปลายในชีวิตจะมีการฆ่าตัวตาย อาจจะเกิดขึ้นจากอารมณ์ชั่ววูบ ความกดดัน</p>";
                                break;     

                            case 71:
                                echo"<p>พลังแห่งการถูกโจมตี
                                เลข 71 ไม่ดีเลย เป็นเลขบ่งบอกถึงความตกต่ำ ถูกใส่ร้าย คดีความ วิบัติ ฉิบหาย การหลงมัวเมา เรื่องความรักก็ไม่สมหวังทั้งสตรีและบุรุษ</p>";
                                break;

                            case 72:
                                echo"<p>พลังชะตาแข็ง
                                เลข 72 ชีวิตเจริญรุ่งเรืองดี แต่มักวุ่นวาย มักจะได้รับทุกข์อันเกิดจากเพศตรงข้าม มีเคราะห์บ่อยๆ และให้ระวังเรื่องโรคภัยไข้เจ็บ</p>";
                                break;
                            
                            case 73:
                                echo"<p>พลังดาวบาปเคราะห์ที่ร้ายแรง
                                เลข 73 ไม่ดีเลย ระวังเรื่องที่เกิดขึ้นโดยฉับพลันอย่างไม่ทันตั้งตัว เช่น อุบัติเหตุ ผ่าตัด ล้มละลาย ชีวิตไม่ค่อยประสบความสำเร็จ วิธีแก้ควรปล่อยวางกับชีวิตบ้าง</p>";
                                break;
                            
                            case 74:
                                echo"<p>พลังอารมณ์ที่อ่อนไหว
                                เลข 74 มีความสำเร็จดี ถึงไม่ก้าวหน้าสูงสุด ก็ประสบความสำเร็จในระดับหนึ่ง ระวังอย่าหูเบาเชื่อคนง่าย</p>";
                                break;
                            
                            case 75:
                                echo"<p>พลังต้นร้ายปลายดี
                                เลข 75 ต้นร้ายปลายดี คือเบื้องต้นไม่ประสบความสำเร็จ แต่บั้นปลายชีวิตจะรุ่งโรจน์มาก ชีวิตมีความวุ่นวาย มักถูกตำหนิจากผู้ใหญ่ ผู้ใหญ่ให้โทษ เลขนี้ไม่เหมาะกับนักธุรกิจ</p>";
                                break;
                            
                            case 76:
                                echo"<p>พลังความยากลำบาก
                                เลข 76 ไม่ดีเลย ชีวิตมักจะอับเฉา บ้านแตกสาแหรกขาด ไม่มีความสุขในชีวิตสมรสมักร้างคู่</p>";
                                break;

                            case 77:
                                echo"<p>พลังแห่งความกดดัน
                                เลข 77 ไม่ดีเลย บ่งถึงความทุกข์สองเท่า มีแต่ความโชคร้าย มักมีโรคภัยไข้เจ็บ ชีวิตเหน็ดเหนื่อยมาก แต่ดีตรงที่มีคนยำเกรง มีอำนาจบารมี</p>";
                                break;
                            
                            case 78:
                                echo"<p>พลังแห่ง ความเดือดร้อน
                                เลข 78 ไม่ค่อยดีนัก เจอเรื่องร้ายๆ บ่อย ให้ระวังเรื่องอุบัติเหตุและคดีความ อย่าใจอ่อนเชื่อคนง่าย</p>";
                                break;
                            
                            case 79:
                                echo"<p>พลังทรัพย์และสุขภาพ
                                เลข 79 จัดอยู่ในเกณฑ์ดี มีฐานะมั่นคง บรรพบุรุษเป็นคนดี สร้างฐานะไว้ดี คุณจะได้รับทรัพย์มรดก หรือสิ่งที่ท่านสร้างไว้ให้ ไม่เดือดร้อนเรื่องการเงิน ลงทุนทำธุรกิจอะไรก็จะประสบความสำเร็จ แต่อย่าหักโหมจนลืมรักษาสุขภาพตัวเอง สุขภาพดีมาก ไม่มีโรคภัยไข้เจ็บ แต่หากมีก็หายในไม่ช้า ชีวิตมีอุปสรรคบ้างแต่ไม่ค่อยมาก ต้องลำบากก่อนจึงจะได้ดี</p>";
                                break;
                            
                            case 80:
                                echo"<p>พลังอัปมงคล
                                เลข 80 ไม่ดีมากๆ เลย ถูกครอบงำ ถูกข่มเหงรังแกจากคนไม่ดี (คนพาล) ถูกข่มขี่ ถูกปล้นจี้ ชิงทรัพย์ ผู้หญิงระวังการถูกฆ่าข่มขืน</p>";
                                break;
                            
                            case 81:
                                echo"<p>พลังการพลัดพราก
                                เลข 81 ไม่ดีเลย กำพร้า อาภัพ พลัดพรากจากบุพการี อยู่ไม่เป็นที่ โยกย้ายบ่อย แต่ชะตาชีวิตก็รุ่งเรืองดี</p>";
                                break;

                            case 82:
                                echo"<p>พลังที่ไม่มั่นคง
                                เลข 82 ชีวิตมักจะหว้าเหว่หงอยเหงา ถ้าเป็นชายมีโอกาสไร่คู่ หรืออาภัพคู่ ถ้าเป็นหญิงจะมีพ่อหม้ายเข้ามาพัวพัน</p>";
                                break;
                                
                            case 83:
                                echo"<p>พลังความผิดพลาด
                                เลข 83 ไม่ดี มักมีเหตุให้แตกหักเสียหายเสมอ ระวังภัยคุกคามจากคนไม่ดี (คนพาล) ระวังอย่าเชื่อคนง่าย</p>";
                                break;
                                
                            case 84:
                                echo"<p>พลังเลขร้าย
                                เลข 84 เป็นเลขไม่ดีเลย มักประสบชะตากรรมไม่ดี (โชคร้าย) ระวังเรื่องอุบัติเหตุ คดีความ</p>";
                                break;
                                
                            case 85:
                                echo"<p>พลังความหลงผิด
                                เลข 85 อาจหลงผิดได้ง่าย ลืมตัว เอาแต่ใจตัวเอง มักกำพร้าและขาดที่พึ่ง</p>";
                                break;
                                
                            case 86:
                                echo"<p>พลังสำเร็จที่ต้องตั้งใจ
                                เลข 86 ชีวิตทางโลกจะประสบความสำเร็จ แต่พ่ายแพ้ทางโลกีย์ ชีวิตจะลุ่มหลงมัวเมา ระวังจิตใจที่ใฝ่ไปในทางไม่ดี</p>";
                                break;

                            case 87:
                                echo"<p>พลังรักลวง
                                เลข 87 เป็นคนมีเสน่ห์ แต่จิตใจอ่อนไหวง่าย เจ้าอารมณ์ อมทุกข์ มักหลงผิด หูเบา เชื่อใจคนง่าย ชีวิตบั้นปลายจึงมักตกต่ำ</p>";
                                break;

                            case 88:
                                echo"<p>พลังความสำเร็จที่แฝงความความร้ายแรง
                                เลข 88 ชีวิตประสบความสำเร็จอย่างรวดเร็ว แต่ระวังเรื่องอุบัติเหตุ หรือสิ่งที่ไม่คาดคิดอย่างฉับพลัน</p>";
                                break;

                            case 89:
                                echo"<p>พลังแห่งความเชื่อ
                                เลข 89 เป็นคนหัวไว ฉลาด เข้าสังคมได้ดีทุกระดับ แต่ข้อเสียต้้องระวังการลุ่มหลง</p>";
                                break;
                                
                            case 90:
                                echo"<p>พลังสิ่งศักดิ์สิทธิ์คุ้มครอง
                                เลข 90 เชื่อเรื่องโชคลาง ดวงดีมีสิ่งศักดิ์สิทธิ์คุ้มครอง มักแคล้วคลาดจากอันตรายต่างๆ ตกน้ำไม่ไหลตกไฟไม่ไหม้ มีปาฏิหารย์บ่อยๆ เลขนี้ดีมีความปลอดภัยในชีวิต ดีมาก มีเทวดารักษาคุ้มครอง เรื่องหน้าที่การงานการเงินการดำเนินชีวิตถือว่าก้าวหน้าได้มาก</p>";
                                break;

                            case 91:
                            echo "<p>พลังความการแสวงหา
                            เลข 91 เป็นคนใฝ่หาความก้าวหน้า มีความพยายาม ขยันขันแข็ง แต่ชอบสันโดษ ชีวิตบางครั้งเหมือนอมทุกข์ ด้านการงานดีมาก แต่เสียด้านสุขภาพ ระวังจะมีโรคภัยเบียดเบียน</p>";
                            break;

                            case 92:
                            echo "<p>พลังอนุรักษ์นิยม
                            เลข 92 ค่อนข้างหัวอนุรักษ์นิยม ชื่นชอบและสะสมของเก่า ชอบเรื่องในอดีต รักการค้นคว้า มีความอ่อนโยน มีเพื่อนฝูงมาก</p>";
                            break;

                            case 93:
                            echo "<p>ความสำเร็จที่รุ่มร้อน
                            เลข 93 เป็นคนแข็งกร้าว เอาแต่ใจตัวเอง ชีวิตมักจะประสบอุบัติเหตุอยู่เสมอ</p>";
                            break;

                            case 94:
                                echo "<p>พลังหลงงมงาย
                                เลข 94 ไม่ค่อยดี มีความสำเร็จแต่ชีวิตมีอุปสรรคมาก ต้องผ่าฟันอุปสรรคอยู่เสมอ</p>";
                            break;

                            case 95:
                                echo"<p>พลังความสำเร็จบารมี
                                เลข 95 เป็นมงคลและมีผลดีมากๆ เป็นผู้โชคดีอยู่เสมอ มีคนคอยช่วยเหลือและคุ้มครอง มีเกียติยศชื่อเสียง มีคนนับถือมาก อยู่ในศีลธรรมอันดี หยั่งรู้เหตุการณ์ล่วงหน้า คู่ครองดีรักคุณมาก เกื้อกูลกันตลอดไป ตกน้ำไม่ไหลตกไฟไม่ไหม้</p>";
                                break;

                            case 96:
                                echo"<p>พลังที่อ่อนแอ
                                เลข 96 เป็นคนใจอ่อน ระวังการหลงผิด ถ้าคบคนดีก็ดีไป ถ้าคบคนชั่ว ก็จะชั่วตามเขาไปด้วย</p>";
                                break;
                                
                            case 97:
                                echo"<p>พลังความรุ่งโรจน์
                                เลข 97 เป็นเลขดีชีวิตมีความรุ่งโรจน์ เหมือนฟ้าประทาน ประสบความสำเร็จในตำแหน่งหน้าที่การงาน ค้าขายได้กำไร ร่ำรวยด้วยทรัพย์สินเงินทอง มีคนเคารพนับถือ มีเกียรติในสังคม มีเพื่อนมากมาย แต่ควรระวังเรื่องอุบัติเหตุ อย่าประมาท ควรทำบุญสะเดาะเคราะห์จะเสริมดวงชะตาได้มาก</p>";
                                break;

                            case 98:
                                echo"<p>พลังลาภลอย
                                เลข 98 ชีวิตประสบความสำเร็จดี มีพวกพ้องมาก ระวังเรื่องการคบคน</p>";
                                break;
                            
                            case 99:
                                echo"<p>พลังการหยั่งรู้
                                เลข 99 มีอำนาจพิเศษ มีญาณหยั่งรู้เหตุการณ์ล่วงหน้าได้อย่างแม่นยำ มีประสาทสัมผัสพิเศษ มีพลังทางจิต ทำอะไรพระคุ้มครอง มีความเจริญและมีความสุข</p>";
                                break;
                                    
                            case 100:
                                echo"<p>พลังแห่งสมดุลจักรวาล
                                เลข 100 เป็นเลขมงคลมาก โชคดีมีลาภ ชีวิตจะรุ่งเรืองเฟื่องฟูมาก มีการงานตำแหน่งสูง หน้าที่การงาน การเงินก้าวหน้าก้าวไกล เกียติยศปรากฎไกล มีเกียรติในสังคม สมบูรณ์ทุกอย่าง สุขภาพดี ไม่มีโรคภัยไข้เจ็บ ด้านความรักก็ดี คนรักฉลาด มีรูปสมบัติพร้อมทรัพย์สินมากมาย รักกันดี พึ่งพากันและกันดวงชะตาเป็นคู่กันตลอดไป เลขกำลัง 100 นี้ดีนักไม่มีจุดเสียเลย มีแต่ความรุ่งโรจน์และสมบูรณ์ทุกอย่าง</p>";
                                break;


                        default:
                        echo "ไม่มีเลขนี้ให้ทำนาย มีเฉพาะเลข 1 - 100 เท่านั้น";
                        }



        }



        else {
            echo "<br><center>ยังไม่ได้ใส่เลข..โปรดใส่เลขมือถือ!!</center>";
        }


        ?>










            </hr>

            <div class="w3-panel w3-pale-yellow w3-topbar w3-bottombar w3-border-yellow">
                <p>เป็นความเชื่อส่วนบุคคล โปรดใช้วิจารณญาณ
                ทำนายตามผลรวมและเลขคู่ของเบอร์มือถือเท่านั้น</p>
            </div>
            <br>
            <p><center><button class="w3-button w3-purple"><a href="https://www.nethivath.com/bersimdee/index.html"> ตรวจคำทำนายเบอร์มือถือ</a></button></center></p>
            <br><br>


            <script>
            function myFunction(id) {
            var x = document.getElementById(id);
            if (x.className.indexOf("w3-show") == -1) {
                x.className += " w3-show";
                x.previousElementSibling.className = 
                x.previousElementSibling.className.replace("w3-black", "w3-red");
            } else { 
                x.className = x.className.replace(" w3-show", "");
                x.previousElementSibling.className = 
                x.previousElementSibling.className.replace("w3-red", "w3-black");
            }
            }
</script>
</div>
</body>
</html>